In [1]:
import findspark

In [2]:
findspark.init('D:/spark')

In [3]:
from pyspark.sql import SparkSession

# Create SparkSession

In [6]:
spark = SparkSession.builder \
.master("local[4]")\
.appName("DataframeToPythonList")\
.getOrCreate()

# Create Spark Dataframe

In [21]:
py_dict = {
    "name":["Erkan","Mehmet","Buse","Burcu","Osman","Metin"],
    "age":[41,36,23,32,45,58],
    "city":["Ankara","İstanbul","Kayseri","Konya","Denizli","Şırnak"]
          
          }

In [22]:
import pandas as pd
pd_df = pd.DataFrame(py_dict)

In [23]:
df = spark.createDataFrame(pd_df)

In [24]:
df.show()

+------+---+--------+
|  name|age|    city|
+------+---+--------+
| Erkan| 41|  Ankara|
|Mehmet| 36|İstanbul|
|  Buse| 23| Kayseri|
| Burcu| 32|   Konya|
| Osman| 45| Denizli|
| Metin| 58|  Şırnak|
+------+---+--------+

# Spark DF to Pandas DF

In [25]:
pd_df1 = df.toPandas()

In [26]:
pd_df1.head()

     name  age      city
0   Erkan   41    Ankara
1  Mehmet   36  İstanbul
2    Buse   23   Kayseri
3   Burcu   32     Konya
4   Osman   45   Denizli

# Pandas DF to Python list

In [41]:
for index, row in pd_df1.iterrows():
    print([row[0],row[1],row[2]])

['Erkan', 41, 'Ankara']
['Mehmet', 36, 'İstanbul']
['Buse', 23, 'Kayseri']
['Burcu', 32, 'Konya']
['Osman', 45, 'Denizli']
['Metin', 58, 'Şırnak']